# Global taps
tap "homebrew/bundle"
tap "homebrew/core"

if OS.mac? # Mac only
    # Taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    # Applications
    cask "postman"
    cask "spotify"
    cask "firefox"
    cask "google-chrome"
    cask "alfred"
    cask "alt-tab"
    cask "mos"
    cask "numi"
    cask "forklift"
    cask "rectangle"
    cask "appcleaner"
    
    # Packages
    brew "reattach-to-user-namespace"
elsif OS.linux? # Linux only
    brew "xclip"
end

# Global packages
brew "curl"
brew "httpie"
brew "jq"
brew "fd"
brew "fzf"
brew "lf"
brew "tmux"
brew "tree"
brew "vim"
brew "neofetch"
brew "htop"
brew "file"
brew "zsh"
brew "eza"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "helm"
brew "yh"
brew "bat"
brew "git-delta"
brew "csvkit"
brew "xsv"
